BaseConfiguration/Money_2_0/InformationRegisters/ОбъектыОпераций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ОбъектыОпераций</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаПоступления</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>14</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаСписания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>14</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РазделУчета</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.РазделыУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПредметУчета</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФинансоваяЦель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФинансовыеЦели</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Операция</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипПоказателя</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыБюджетныхПоказателей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЭтоШаблон</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

BaseConfiguration/Money_2_0/Catalogs/ФинансовыеЦели.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ФинансовыеЦели</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Активность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитДопУпорядочивания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеФинансовойЦели</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Срок</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонНакопления</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Доход</v8:Type>
						<v8:Type>cfg:DocumentRef.Перемещение</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрольнаяСумма</Name>
					<Comment>Контрольная сумма объекта</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>65</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МоментИзменения</Name>
					<Comment>Универсальное время последнего изменения объекта в миллисекундах</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

BaseConfiguration/Money_2_0/InformationRegisters/ОбъектыОпераций/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПроверитьЗаписиРегистра(БылиОшибки = Ложь) Экспорт
	
	БылиОшибки = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"Выбрать РАЗЛИЧНЫЕ
	|	РС.Операция КАК Операция
	|Из
	|	РегистрСведений.ОбъектыОпераций КАК РС
	|Где
	|	РС.Операция.Ссылка ЕСТЬ NULL
	|;
	|//1//////////////////////////////
	|Выбрать РАЗЛИЧНЫЕ
	|	РС.ПредметУчета КАК ПредметУчета
	|Из
	|	РегистрСведений.ОбъектыОпераций КАК РС
	|Где
	|	РС.ПредметУчета.Ссылка ЕСТЬ NULL
	|;
	|//2//////////////////////////////
	|Выбрать РАЗЛИЧНЫЕ
	|	РС.ФинансоваяЦель КАК ФинансоваяЦель
	|Из
	|	РегистрСведений.ОбъектыОпераций КАК РС
	|Где
	|	РС.ФинансоваяЦель <> Значение(Справочник.ФинансовыеЦели.ПустаяСсылка) И РС.ФинансоваяЦель.Ссылка ЕСТЬ NULL
	|;
	|//3//////////////////////////////
	|Выбрать РАЗЛИЧНЫЕ
	|	РС.Валюта КАК Валюта
	|Из
	|	РегистрСведений.ОбъектыОпераций КАК РС
	|Где
	|	РС.Валюта <> Значение(Справочник.Валюты.ПустаяСсылка) И РС.Валюта.Ссылка ЕСТЬ NULL
	|";
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	// несуществуюшие операции
	Выборка = РезультатыЗапроса[0].Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Ссылка = Выборка.Операция;
		Попытка
			УдалитьЗапись(Новый Структура("Операция", Ссылка));
		Исключение
			БылиОшибки = Истина;
			ЗарегистрироватьОшибку(ИнформацияОбОшибке(), Ссылка, "Ошибка очистки объектов операций по документу");
		КонецПопытки;
		
	КонецЦикла; 
		
	// несуществуюшие ссылки справочников
	Выборка = РезультатыЗапроса[1].Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Ссылка = Выборка.ПредметУчета;
		Если Не ОбщегоНазначения.ЭтоСсылка(ТипЗнч(Ссылка)) Или Не ЗначениеЗаполнено(Ссылка) Тогда
			// Допускаются пустые значения
			Продолжить;
		КонецЕсли;
		
		Попытка
			УдалитьЗапись(Новый Структура("ПредметУчета", Ссылка));
		Исключение
			БылиОшибки = Истина;
			ЗарегистрироватьОшибку(ИнформацияОбОшибке(), Ссылка, "Ошибка очистки объектов операций по предмету учета");
		КонецПопытки;
		
	КонецЦикла; 
		
	// несуществуюшие финансовые цели
	Выборка = РезультатыЗапроса[2].Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Ссылка = Выборка.ФинансоваяЦель;
		Если Не ОбщегоНазначения.ЭтоСсылка(ТипЗнч(Ссылка)) Или Не ЗначениеЗаполнено(Ссылка) Тогда
			Продолжить;
		КонецЕсли;
		
		Попытка
			УдалитьЗапись(Новый Структура("ФинансоваяЦель", Ссылка));
		Исключение
			БылиОшибки = Истина;
			ЗарегистрироватьОшибку(ИнформацияОбОшибке(), Ссылка, "Ошибка очистки объектов операций по финансовой цели");
		КонецПопытки;
		
	КонецЦикла; 
		
	// несуществуюшие валюты
	Выборка = РезультатыЗапроса[3].Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Ссылка = Выборка.Валюта;
		Если Не ОбщегоНазначения.ЭтоСсылка(ТипЗнч(Ссылка)) Или Не ЗначениеЗаполнено(Ссылка) Тогда
			Продолжить;
		КонецЕсли;
		
		Попытка
			УдалитьЗапись(Новый Структура("Валюта", Ссылка));
		Исключение
			БылиОшибки = Истина;
			ЗарегистрироватьОшибку(ИнформацияОбОшибке(), Ссылка, "Ошибка очистки объектов операций по валюте");
		КонецПопытки;
		
	КонецЦикла; 
		
КонецПроцедуры

// Процедура удаляет набор записей в регистре по переданным значениям структуры.
Процедура УдалитьЗапись(СтруктураЗаписи, Загрузка = Ложь) Экспорт
	
	ОбменДаннымиСлужебный.УдалитьНаборЗаписейВРегистреСведений(СтруктураЗаписи, "ОбъектыОпераций", Загрузка);
	
КонецПроцедуры


#Область СлужебныеПроцедурыИФункции

Процедура ЗарегистрироватьОшибку(Ошибка, Данные, Комментарий)
	
	ТипДанных = ТипЗнч(Данные);
	ЗаписьЖурналаРегистрации("Справочники.Объекты операций", УровеньЖурналаРегистрации.Ошибка, , Данные,
			СтрШаблон("%1 ""%2"" (%3): 
			|%4", Комментарий, Данные, ТипДанных, ПодробноеПредставлениеОшибки(Ошибка)));
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
